In [1]:
import pandas as pd 
import sqlalchemy
import ta

In [2]:
#Extract data from established postgres db
db_pass = 'Jalisco1995?'
demo_engine = sqlalchemy.create_engine(f'postgresql://postgres:{db_pass}@localhost/stock_data')

In [48]:
names = pd.read_sql("""SELECT tablename FROM pg_tables where schemaname='public' """,demo_engine)

In [49]:
names

   tablename
0        MMM
1        AXP
2       AMGN
3       AAPL
4         BA
5        CAT
6        CVX
7       CSCO
8         KO
9        DIS
10       DOW
11        GS
12        HD
13       HON
14       IBM
15      INTC
16       JNJ
17       JPM
18       MCD
19       MRK
20      MSFT
21       NKE
22        PG
23       CRM
24       TRV
25       UNH
26        VZ
27         V
28       WBA
29       WMT

In [50]:
names = names.tablename.to_list()

In [52]:
#extract data fields fromm sql tables and store aggregate data into df list
framelist = []

for name in names:
    framelist.append(pd.read_sql(f'SELECT "Date", "Close" FROM "{name}"',demo_engine))

In [53]:
framelist

[            Date       Close
 0     1962-01-02    4.156250
 1     1962-01-03    4.187500
 2     1962-01-04    4.187500
 3     1962-01-05    4.078125
 4     1962-01-08    4.054688
 ...          ...         ...
 15210 2022-06-03  145.970001
 15211 2022-06-06  146.210007
 15212 2022-06-07  146.869995
 15213 2022-06-08  145.419998
 15214 2022-06-09  144.179993

 [15215 rows x 2 columns],
             Date       Close
 0     1972-06-01    3.693287
 1     1972-06-02    3.677195
 2     1972-06-05    3.604777
 3     1972-06-06    3.411664
 4     1972-06-07    3.371432
 ...          ...         ...
 12505 2022-06-03  166.830002
 12506 2022-06-06  167.020004
 12507 2022-06-07  168.690002
 12508 2022-06-08  165.960007
 12509 2022-06-09  160.979996

 [12510 rows x 2 columns],
            Date       Close
 0    1983-06-17    0.343750
 1    1983-06-20    0.302083
 2    1983-06-21    0.302083
 3    1983-06-22    0.312500
 4    1983-06-23    0.312500
 ...         ...         ...
 9819 2022-06-03  248.449997
 9820 2022-06-06  245.440002
 9821 2022-06-07  246.410004
 9822 2022-06-08  245.479996
 9823 2022-06-09  241.750000

 [9824 rows x 2 columns],
             Date       Close
 0     1980-12-12    0.128348
 1     1980-12-15    0.121652
 2     1980-12-16    0.112723
 3     1980-12-17    0.115513
 4     1980-12-18    0.118862
 ...          ...         ...
 10457 2022-06-03  145.380005
 10458 2022-06-06  146.139999
 10459 2022-06-07  148.710007
 10460 2022-06-08  147.960007
 10461 2022-06-09  142.639999

 [10462 rows x 2 columns],
             Date       Close
 0     1962-01-02    0.823045
 1     1962-01-03    0.839506
 2     1962-01-04    0.831276
 3     1962-01-05    0.814815
 4     1962-01-08    0.816872
 ...          ...         ...
 15210 2022-06-03  139.250000
 15211 2022-06-06  139.240005
 15212 2022-06-07  140.820007
 15213 2022-06-08  139.630005
 15214 2022-06-09  133.729996

 [15215 rows x 2 columns],
             Date       Close
 0     1962-01-02    1.604167
 1     1962-01-03    1.619792
 2     1962-01-04    1.661458
 3     1962-01-05    1.677083
 4     1962-01-08    1.687500
 ...          ...         ...
 15210 2022-06-03  222.899994
 15211 2022-06-06  223.630005
 15212 2022-06-07  227.100006
 15213 2022-06-08  229.800003
 15214 2022-06-09  223.669998

 [15215 rows x 2 columns],
             Date       Close
 0     1962-01-02    3.296131
 1     1962-01-03    3.288690
 2     1962-01-04    3.258929
 3     1962-01-05    3.177083
 4     1962-01-08    3.162202
 ...          ...         ...
 15209 2022-06-03  177.600006
 15210 2022-06-06  176.830002
 15211 2022-06-07  180.199997
 15212 2022-06-08  181.130005
 15213 2022-06-09  177.520004

 [15214 rows x 2 columns],
            Date      Close
 0    1990-02-16   0.077257
 1    1990-02-20   0.079861
 2    1990-02-21   0.078125
 3    1990-02-22   0.078993
 4    1990-02-23   0.078559
 ...         ...        ...
 8136 2022-06-03  45.250000
 8137 2022-06-06  45.330002
 8138 2022-06-07  45.570000
 8139 2022-06-08  44.919998
 8140 2022-06-09  44.259998

 [8141 rows x 2 columns],
             Date      Close
 0     1962-01-02   0.263021
 1     1962-01-03   0.257161
 2     1962-01-04   0.259115
 3     1962-01-05   0.253255
 4     1962-01-08   0.250651
 ...          ...        ...
 15210 2022-06-03  62.970001
 15211 2022-06-06  62.869999
 15212 2022-06-07  63.250000
 15213 2022-06-08  62.889999
 15214 2022-06-09  61.799999

 [15215 rows x 2 columns],
             Date       Close
 0     1962-01-02    0.092908
 1     1962-01-03    0.094155
 2     1962-01-04    0.094155
 3     1962-01-05    0.094467
 4     1962-01-08    0.094155
 ...          ...         ...
 15209 2022-06-03  108.669998
 15210 2022-06-06  107.830002
 15211 2022-06-07  107.790001
 15212 2022-06-08  107.339996
 15213 2022-06-09  103.300003

 [15214 rows x 2 columns],
           Date      Close
 0   2019-03-20  49.799999
 1   2019-03-21  48.980000
 2   2019-03-22  48.599998
 3   2019-03-25  49.150002
 4   2019-03-26  48.849998
 ..         ...        ...
 809 2022-06-03  67.029999
 810 2022-06-06  67.070000
 811 2022-06-07  67.370003
 812 2022-06-08  67.239998
 813 2022-06-09  65.860001

 [814 rows x 2 columns],
            Date       Close
 0    1999-05-04   70.375000
 1    1999-05-05   69.125000
 2    1999-05-06   67.937500
 3    1999-05-07   74.125000
 4    1999-05-10   70.687500
 ...         ...         ...
 5810 2022-06-03  318.679993
 5811 2022-06-06  320.510010
 5812 2022-06-07  321.510010
 5813 2022-06-08  314.679993
 5814 2022-06-09  304.220001

 [5815 rows x 2 columns],
             Date       Close
 0     1981-09-22    0.029995
 1     1981-09-23    0.029995
 2     1981-09-24    0.029995
 3     1981-09-25    0.029995
 4     1981-09-28    0.029995
 ...          ...         ...
 10236 2022-06-03  305.079987
 10237 2022-06-06  303.890015
 10238 2022-06-07  301.769989
 10239 2022-06-08  297.529999
 10240 2022-06-09  299.859985

 [10241 rows x 2 columns],
             Date       Close
 0     1962-01-02    8.310028
 1     1962-01-03    8.403609
 2     1962-01-04    8.459758
 3     1962-01-05    8.441042
 4     1962-01-08    8.478474
 ...          ...         ...
 15208 2022-06-03  194.820007
 15209 2022-06-06  195.190002
 15210 2022-06-07  197.619995
 15211 2022-06-08  194.520004
 15212 2022-06-09  192.009995

 [15213 rows x 2 columns],
             Date       Close
 0     1962-01-02    7.291268
 1     1962-01-03    7.355003
 2     1962-01-04    7.281708
 3     1962-01-05    7.138305
 4     1962-01-08    7.004461
 ...          ...         ...
 15208 2022-06-03  141.179993
 15209 2022-06-06  142.880005
 15210 2022-06-07  142.779999
 15211 2022-06-08  140.830002
 15212 2022-06-09  137.960007

 [15213 rows x 2 columns],
             Date      Close
 0     1980-03-17   0.325521
 1     1980-03-18   0.322917
 2     1980-03-19   0.330729
 3     1980-03-20   0.329427
 4     1980-03-21   0.317708
 ...          ...        ...
 10644 2022-06-03  43.389999
 10645 2022-06-06  43.340000
 10646 2022-06-07  43.529999
 10647 2022-06-08  41.230000
 10648 2022-06-09  40.009998

 [10649 rows x 2 columns],
             Date       Close
 0     1962-01-02    0.223380
 1     1962-01-03    0.219907
 2     1962-01-04    0.217593
 3     1962-01-05    0.214120
 4     1962-01-08    0.210648
 ...          ...         ...
 15200 2022-06-03  176.419998
 15201 2022-06-06  176.399994
 15202 2022-06-07  178.339996
 15203 2022-06-08  177.279999
 15204 2022-06-09  173.710007

 [15205 rows x 2 columns],
             Date       Close
 0     1980-03-17    5.037037
 1     1980-03-18    5.074074
 2     1980-03-19    5.148148
 3     1980-03-20    5.111111
 4     1980-03-21    5.222222
 ...          ...         ...
 10645 2022-06-03  130.160004
 10646 2022-06-06  129.729996
 10647 2022-06-07  130.070007
 10648 2022-06-08  128.000000
 10649 2022-06-09  125.309998

 [10650 rows x 2 columns],
             Date       Close
 0     1966-07-05    0.269547
 1     1966-07-06    0.283951
 2     1966-07-07    0.273663
 3     1966-07-08    0.276749
 4     1966-07-11    0.275720
 ...          ...         ...
 14075 2022-06-03  248.360001
 14076 2022-06-06  248.070007
 14077 2022-06-07  248.940002
 14078 2022-06-08  245.610001
 14079 2022-06-09  242.160004

 [14080 rows x 2 columns],
             Date      Close
 0     1962-01-02   0.395374
 1     1962-01-03   0.378808
 2     1962-01-04   0.374943
 3     1962-01-05   0.362242
 4     1962-01-08   0.363346
 ...          ...        ...
 15209 2022-06-03  89.910004
 15210 2022-06-06  89.839996
 15211 2022-06-07  90.480003
 15212 2022-06-08  89.480003
 15213 2022-06-09  88.000000

 [15214 rows x 2 columns],
            Date       Close
 0    1986-03-13    0.097222
 1    1986-03-14    0.100694
 2    1986-03-17    0.102431
 3    1986-03-18    0.099826
 4    1986-03-19    0.098090
 ...         ...         ...
 9131 2022-06-03  270.019989
 9132 2022-06-06  268.750000
 9133 2022-06-07  272.500000
 9134 2022-06-08  270.410004
 9135 2022-06-09  264.790009

 [9136 rows x 2 columns],
             Date       Close
 0     1980-12-02    0.179688
 1     1980-12-03    0.175781
 2     1980-12-04    0.181641
 3     1980-12-05    0.171875
 4     1980-12-08    0.162109
 ...          ...         ...
 10463 2022-06-03  120.949997
 10464 2022-06-06  120.230003
 10465 2022-06-07  121.669998
 10466 2022-06-08  122.400002
 10467 2022-06-09  118.599998

 [10468 rows x 2 columns],
             Date       Close
 0     1962-01-02    1.429688
 1     1962-01-03    1.414063
 2     1962-01-04    1.390625
 3     1962-01-05    1.380859
 4     1962-01-08    1.343750
 ...          ...         ...
 15208 2022-06-03  145.889999
 15209 2022-06-06  145.320007
 15210 2022-06-07  146.940002
 15211 2022-06-08  145.110001
 15212 2022-06-09  142.490005

 [15213 rows x 2 columns],
            Date       Close
 0    2004-06-23    4.300000
 1    2004-06-24    4.190000
 2    2004-06-25    3.950000
 3    2004-06-28    4.000000
 4    2004-06-29    4.100000
 ...         ...         ...
 4519 2022-06-03  184.910004
 4520 2022-06-06  182.869995
 4521 2022-06-07  187.149994
 4522 2022-06-08  189.190002
 4523 2022-06-09  187.110001

 [4524 rows x 2 columns],
             Date       Close
 0     1975-11-17    8.718750
 1     1975-11-18    8.968750
 2     1975-11-19    8.562500
 3     1975-11-20    8.437500
 4     1975-11-21    8.437500
 ...          ...         ...
 11723 2022-06-03  174.190002
 11724 2022-06-06  176.979996
 11725 2022-06-07  178.639999
 11726 2022-06-08  175.970001
 11727 2022-06-09  171.529999

 [11728 rows x 2 columns],
            Date       Close
 0    1984-10-17    0.144531
 1    1984-10-18    0.148438
 2    1984-10-19    0.144531
 3    1984-10-22    0.144531
 4    1984-10-23    0.140625
 ...         ...         ...
 9478 2022-06-03  485.609985
 9479 2022-06-06  490.179993
 9480 2022-06-07  497.100006
 9481 2022-06-08  493.529999
 9482 2022-06-09  489.429993

 [9483 rows x 2 columns],
            Date      Close
 0    1983-11-21   7.897178
 1    1983-11-22   7.869074
 2    1983-11-23   7.826918
 3    1983-11-25   7.742607
 4    1983-11-28   7.531828
 ...         ...        ...
 9713 2022-06-03  50.810001
 9714 2022-06-06  51.240002
 9715 2022-06-07  51.650002
 9716 2022-06-08  51.549999
 9717 2022-06-09  50.939999

 [9718 rows x 2 columns],
            Date       Close
 0    2008-03-19   14.125000
 1    2008-03-20   16.087500
 2    2008-03-24   14.932500
 3    2008-03-25   15.812500
 4    2008-03-26   15.990000
 ...         ...         ...
 3578 2022-06-03  212.649994
 3579 2022-06-06  212.940002
 3580 2022-06-07  214.500000
 3581 2022-06-08  213.500000
 3582 2022-06-09  206.110001

 [3583 rows x 2 columns],
             Date      Close
 0     1980-03-17   0.208984
 1     1980-03-18   0.208008
 2     1980-03-19   0.213867
 3     1980-03-20   0.212891
 4     1980-03-21   0.213867
 ...          ...        ...
 10645 2022-06-03  43.139999
 10646 2022-06-06  43.389999
 10647 2022-06-07  43.000000
 10648 2022-06-08  42.599998
 10649 2022-06-09  41.720001

 [10650 rows x 2 columns],
             Date       Close
 0     1972-08-25    0.064453
 1     1972-08-28    0.064209
 2     1972-08-29    0.063477
 3     1972-08-30    0.063477
 4     1972-08-31    0.062500
 ...          ...         ...
 12531 2022-06-03  125.320000
 12532 2022-06-06  124.870003
 12533 2022-06-07  123.370003
 12534 2022-06-08  122.300003
 12535 2022-06-09  121.019997

 [12536 rows x 2 columns]]

In [54]:
#function to compute the MACD (moving average convergence divergence)
def MACDdecision(df):
    df['MACD_diff']  = ta.trend.macd_diff(df.Close)
    #The decision to buy will be determinded as based to a delta greater than 0 on the current day and smaller than 0 on the day before
    df.loc[(df.MACD_diff > 0) & (df.MACD_diff.shift(1) < 0), 'Decision_MACD'] = 'Buy'

In [55]:
#fucntion for RSI (relative strenght index) and SMA (simple moving average)
def RSI_SMAdecision(df):
    df['RSI'] = ta.momentum.rsi(df.Close, window=10)
    df['SMA200'] = ta.trend.sma_indicator(df.Close, window=200)
    #check for when the price is above the 200 day moving average and the RSI is below 30
    df.loc[(df.Close > df.SMA200) & (df.RSI < 30), 'Decision_RSI_SMA'] = 'Buy'

In [56]:
#loop over all 30 dfs in list to apply functions 
for frame in framelist:
    MACDdecision(frame)
    RSI_SMAdecision(frame)

In [58]:
framelist[0]

,Date,Close,MACD_diff,Decision_MACD,RSI,SMA200,Decision_RSI_SMA
0,1962-01-02,4.156250,NaN,NaN,NaN,NaN,NaN
1,1962-01-03,4.187500,NaN,NaN,NaN,NaN,NaN
2,1962-01-04,4.187500,NaN,NaN,NaN,NaN,NaN
3,1962-01-05,4.078125,NaN,NaN,NaN,NaN,NaN
4,1962-01-08,4.054688,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...
15210,2022-06-03,145.970001,-0.035269,NaN,44.973851,167.03970,NaN
15211,2022-06-06,146.210007,-0.078015,NaN,45.753619,166.79395,NaN
15212,2022-06-07,146.869995,-0.054632,NaN,48.004909,166.55750,NaN
15213,2022-06-08,145.419998,-0.125557,NaN,43.588947,166.31120,NaN
15214,2022-06-09,144.179993,-0.238188,NaN,40.085163,166.05835,NaN

In [59]:
for name,frame in zip(names,framelist):
    if frame['Decision_MACD'].iloc[-1] == 'Buy':
        print("Buying signal MACD for " + name)
    if frame['Decision_RSI_SMA'].iloc[-1] == 'Buy':
        print("Buying signal RSI_SMA for " + name)

In [60]:
goal = framelist[0]
goal.head()

        Date     Close  MACD_diff Decision_MACD  RSI  SMA200 Decision_RSI_SMA
0 1962-01-02  4.156250        NaN           NaN  NaN     NaN              NaN
1 1962-01-03  4.187500        NaN           NaN  NaN     NaN              NaN
2 1962-01-04  4.187500        NaN           NaN  NaN     NaN              NaN
3 1962-01-05  4.078125        NaN           NaN  NaN     NaN              NaN
4 1962-01-08  4.054688        NaN           NaN  NaN     NaN              NaN

In [66]:
goal[(goal.Decision_RSI_SMA == 'Buy')]

,Date,Close,MACD_diff,Decision_MACD,RSI,SMA200,Decision_RSI_SMA
293,1963-03-01,3.539063,-0.023281,NaN,28.779385,3.300860,Buy
294,1963-03-04,3.539063,-0.025770,NaN,28.779385,3.298516,Buy
355,1963-05-29,3.664063,-0.010158,NaN,29.483742,3.483399,Buy
363,1963-06-11,3.570313,-0.008855,NaN,20.946731,3.497578,Buy
364,1963-06-12,3.585938,-0.009137,NaN,26.800139,3.498633,Buy
...,...,...,...,...,...,...,...
14858,2021-01-11,165.199997,-1.156581,NaN,27.619058,160.414000,Buy
14966,2021-06-16,196.910004,-0.802052,NaN,27.908835,180.155800,Buy
14967,2021-06-17,195.139999,-1.058009,NaN,24.159815,180.316400,Buy
14968,2021-06-18,191.600006,-1.393487,NaN,18.605770,180.450400,Buy
14971,2021-06-23,192.360001,-1.213326,NaN,29.499108,180.856000,Buy